src/test/load/artillery/overlay/overlay-get-test.yaml
config:
  payload:
    # path is relative to the location of the test script
    - path: "test-subset.csv"
      fields:
        - "id"
        - "creationTime"
        - "ttl"
        - "value"
    - path: "../hosts.csv"
      order: sequence
      fields:
        - "host"
  target: http://192.168.0.150:6898
  phases:
    - duration: 800
      arrivalRate: 10

scenarios:
  - name: get
    weight: 1
    flow:
      - loop:
        - get:
            url: "http://{{ host }}/nomad/overlay-storage/get/{{ id }}"
        count: 1